#include "charlie13.h"
int main()
{
    Milktea t;
    sugar s1("È¥ÌÇ"),s2("Èı·ÖÌÇ"),s3("°ëÌÇ"),s4("Æß·ÖÌÇ"),s5("È«ÌÇ");
    tea t1(150,"ºì²è"),t2(150,"ÂÌ²è"),t3(150,"°×²è"),t4(150,"ºì²è"),t5(150,"ÂÌ²è"),t6(150,"°×²è");;
    milk m1(250,"ÒÁÀû"),m2(250,"ÃÉÅ£"),m3(250,"¹âÃ÷"),m4(200,"ÒÁÀû"),m5(200,"ÃÉÅ£"),m6(200,"¹âÃ÷");
    Milktea mt[5]={{"ÕäÖéÄÌ²è","Àä",15,0.95,s2,t1,m3},{"¸ÛÊ½Ë¿ÍàÄÌ²è","ÈÈ",20,0.9,s5,t3,m5},{"ÓóÔ²ÄÌ²è","Àä",18,0.85,s4,t6,m2},
    {"Ã¢¹ûÄÌ²è","Àä",23,0.7,s3,t4,m4},{"¹şÃÜ¹ÏÄÌ²è","Àä",26,0.8,s1,t3,m1}};
    for(int i=0;i<4;i++){
        for (int j=0;j<4-i;j++){
                if(mt[j+1].get_price()>mt[j].get_price()){
                    t=mt[j+1];
                    mt[j+1]=mt[j];
                    mt[j]=t;
                }
        }
    }
    for(int k=0;k<5;k++){
        mt[k].display();
    }
    return 0;  
}