#include "charlie11.h"

int main(){
    float sum=0,sum1=0;
    Milktea mt[8]={{"珍珠奶茶","冷",10,0.95,"少糖","一般",260},{"杨枝甘露","冷",15,0.85,"正常糖","比较推荐",240},{"芋泥奶茶","热",14,0.9,"少糖","非常推荐",320},{"超级杯水果茶","冷",20,0.8,"正常糖","非常推荐",150},{"烧仙草","热",16,0.9,"正常糖","不推荐",350},
    {"芝士葡萄奶盖","冷",20,1.0,"多糖","一般",280},{"柠檬茶","冷",12,0.7,"多糖","非常推荐",180},{"西瓜汁","冷",14,0.85,"正常糖","一般",190}};
    for(int i=0;i<8;i++){
        mt[i].display();
        sum+=mt[i].discount_price();
        sum1+=mt[i].get_calorie();
    }
    cout<<"8杯奶茶折后总价:"<<sum<<"元"<<endl<<endl;
    cout<<"8杯奶茶热量总和:"<<sum1<<"kcal"<<endl<<endl;
    cout<<"八杯奶茶中最实惠的奶茶:"<<endl;
    mt->sort(mt);
    return 0;
}